docs/requests/iti-18-gassmann-tcu.http

### ITI-18 with adding X-Eprik-IDP-Assertio 
POST http://test.ahdis.ch/eprik-cara/services/iti18Endpoint HTTP/1.1
Content-Type: application/soap+xml;charset=UTF-8
X-Eprik-IDP-Assertion-ID: tcu1

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
<saml2:Assertion xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:del="urn:oasis:names:tc:SAML:2.0:conditions:delegation" ID="_fbc7c398-72ac-4815-a900-d3689e858e07" IssueInstant="2022-09-28T10:50:56.412Z" Version="2.0"><saml2:Issuer>http://ith-icoserve.com/eHealthSolutionsSTS</saml2:Issuer><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#_fbc7c398-72ac-4815-a900-d3689e858e07"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="del xsd"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/><ds:DigestValue>Jhd1JHHZJ82G3VzrRWblq6NbO0w635NqPiO0qbdEshE=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>rM/49s2xvuxxbMu3cgupD6Ft1XQNjRnz6YRw8ptV4CQee+VTj4gBSo9JxXVXbBdTsLWjlYOJoJjG6Y6obP/VKQ01Rayv+NmPidSYsfQgkFuGb9V0A/Rc9ti7Qkds8EkFyKC/ajy6ieyn2aW1/yWQZ33fKtCBjdon0/6KginE1aPuIwX3dIKdXAZWuoTKjjk1T88IFi10DDHsgJWPJZxbH0Oxg/c1CH/hmWcJpH08ktMQPaXnMa/G7l3AC1G8fZ/c/IYBCsNYvLcCz2E1HNDE1IySEW8+MRAvLRByC15lhYAfyWwJyPBvDtyQBZpXDNRpZ6nHLydQkIVC48SkM7H60A==</ds:SignatureValue><ds:KeyInfo><ds:X509Data><ds:X509Certificate>MIIGjTCCBXWgAwIBAgIUbB8FOn0SDM4Xdv3U0onn9FS2xMEwDQYJKoZIhvcNAQELBQAwVDELMAkG
A1UEBhMCQ0gxFTATBgNVBAoTDFN3aXNzU2lnbiBBRzEuMCwGA1UEAxMlU3dpc3NTaWduIFBlcnNv
bmFsIEdvbGQgQ0EgMjAxNCAtIEcyMjAeFw0yMDAyMjgwNTQ4MDNaFw0yMzAyMjgwNTQ4MDNaMIGu
MQswCQYDVQQGEwJDSDENMAsGA1UECBMEQmVybjETMBEGA1UEChMKUG9zdCBDSCBBRzEcMBoGA1UE
CxMTRS1IZWFsdGggT3BlcmF0aW9uczEqMCgGCSqGSIb3DQEJARYbb3BlcmF0aW9ucy5lLWhlYWx0
aEBwb3N0LmNoMTEwLwYDVQQDEyhwc2V1ZG86IFNBTUwgU2lnbmVyIENBUkEgSW50ZWdyYXRpb24g
RVBEMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAyRN/xWXNsDNlTOP9nSveg5iUd7lq
u7Tdh5AAgl9Q6ASoTh7zJebI+hk4IObQ7P7WNeyDcdSZPetww8GJ8myfmRoT8jYGMipAbRTh7udk
vx0DOUTwMJX8RLzeGuXACwfWyWe9i6w6kyhIYrT21vcLCFwnyTPW1LaBZoVZCM23xTwBEYQOUc4J
arC9rqrm/2aNVPkd8F3XyjsS3FYW2u1w05Nr2sAIdVbUgmqL1bXxQf/28VNG2i2Z6BZnU37VU0ku
j+m5ocgiRcZomyUue32Rp/2mmnZVoKu6ajqDP4KdaeMrn6sWuvsiNZEL84e+4dPOcI6HuoE+GqKa
b89qirAdOwIDAQABo4IC+jCCAvYwJgYDVR0RBB8wHYEbb3BlcmF0aW9ucy5lLWhlYWx0aEBwb3N0
LmNoMA4GA1UdDwEB/wQEAwID+DA1BgNVHSUELjAsBggrBgEFBQcDAgYIKwYBBQUHAwQGCisGAQQB
gjcKAwQGCisGAQQBgjcUAgIwHQYDVR0OBBYEFONY+Gp1fLQWpSCvOaKC2jxNiMHkMB8GA1UdIwQY
MBaAFNoy+Un4UcyYcWYM2c6225I/CUvvMIH/BgNVHR8EgfcwgfQwR6BFoEOGQWh0dHA6Ly9jcmwu
c3dpc3NzaWduLm5ldC9EQTMyRjk0OUY4NTFDQzk4NzE2NjBDRDlDRUI2REI5MjNGMDk0QkVGMIGo
oIGloIGihoGfbGRhcDovL2RpcmVjdG9yeS5zd2lzc3NpZ24ubmV0L0NOPURBMzJGOTQ5Rjg1MUND
OTg3MTY2MENEOUNFQjZEQjkyM0YwOTRCRUYlMkNPPVN3aXNzU2lnbiUyQ0M9Q0g/Y2VydGlmaWNh
dGVSZXZvY2F0aW9uTGlzdD9iYXNlP29iamVjdENsYXNzPWNSTERpc3RyaWJ1dGlvblBvaW50MGkG
A1UdIARiMGAwVAYJYIV0AVkBAgENMEcwRQYIKwYBBQUHAgEWOWh0dHA6Ly9yZXBvc2l0b3J5LnN3
aXNzc2lnbi5jb20vU3dpc3NTaWduLUdvbGQtQ1AtQ1BTLnBkZjAIBgYEAI96AQEwgdcGCCsGAQUF
BwEBBIHKMIHHMGQGCCsGAQUFBzAChlhodHRwOi8vc3dpc3NzaWduLm5ldC9jZ2ktYmluL2F1dGhv
cml0eS9kb3dubG9hZC9EQTMyRjk0OUY4NTFDQzk4NzE2NjBDRDlDRUI2REI5MjNGMDk0QkVGMF8G
CCsGAQUFBzABhlNodHRwOi8vZ29sZC1wZXJzb25hbC1nMi5vY3NwLnN3aXNzc2lnbi5uZXQvREEz
MkY5NDlGODUxQ0M5ODcxNjYwQ0Q5Q0VCNkRCOTIzRjA5NEJFRjANBgkqhkiG9w0BAQsFAAOCAQEA
b5nvVk+xrwDCcx/C7aKJSkwuE8MvRFwReb5IWJ99FhYx9kHHf0H07xOAbTFEadDxetpn4/5U8RSR
T1ctQQ3VGZT57UyntiWuheyCNuJpLgzcou+I8w1jb+TOeSAF0a0MPHQMrdOpD9ikMuXfhngF4N4u
MUdIxHnOySh7TM+BYDEOauuNaUvOpNs7l1K4haQcS/baXShWuPp7gPg8VoWD1vjRQsx67EV91P2I
GMckyvOXUnYuZb6m1iIaJeJUd8E1Krnwt1Sg3VJVVGjZMIuTU1nX1iaJ5EZLZoTBGGZHY5HqnWZ8
pCY4UzMJTfnBjIPYZK1MxLzBB/cwj1bIxuNyZA==</ds:X509Certificate></ds:X509Data></ds:KeyInfo></ds:Signature><saml2:Subject><saml2:NameID Format="urn:oasis:names:tc:SAML:2.0:nameid-format:persistent" NameQualifier="urn:gs1:gln">2000040030829</saml2:NameID><saml2:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:bearer"><saml2:NameID Format="urn:oasis:names:tc:SAML:2.0:nameid-format:persistent" NameQualifier="urn:e-health-suisse:technical-user-id">2.16.756.5.30.1.999.9.1.1.1</saml2:NameID><saml2:SubjectConfirmationData><saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:subject-id" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:unspecified"><saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xsd:string">IKIT</saml2:AttributeValue></saml2:Attribute></saml2:SubjectConfirmationData></saml2:SubjectConfirmation></saml2:Subject><saml2:Conditions NotBefore="2022-09-28T10:50:55.412Z" NotOnOrAfter="2022-09-28T10:55:56.412Z"><saml2:AudienceRestriction><saml2:Audience>urn:e-health-suisse:token-audience:all-communities</saml2:Audience></saml2:AudienceRestriction><saml2:Condition xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="del:DelegationRestrictionType"><del:Delegate><saml2:NameID Format="urn:oasis:names:tc:SAML:2.0:nameid-format:persistent" NameQualifier="urn:e-health-suisse:technical-user-id">2.16.756.5.30.1.999.9.1.1.1</saml2:NameID></del:Delegate></saml2:Condition></saml2:Conditions><saml2:AuthnStatement AuthnInstant="2022-09-28T10:50:56.412Z"><saml2:AuthnContext><saml2:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:PasswordProtectedTransport</saml2:AuthnContextClassRef></saml2:AuthnContext></saml2:AuthnStatement><saml2:AttributeStatement><saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:subject-id"><saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xsd:string">Oliver Egger</saml2:AttributeValue></saml2:Attribute><saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:role"><saml2:AttributeValue><Role xmlns="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" code="HCP" codeSystem="2.16.756.5.30.1.127.3.10.6" codeSystemName="eHealth Suisse EPR Actors" displayName="Healthcare professional" xsi:type="CE"/></saml2:AttributeValue></saml2:Attribute><saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization"><saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xsd:string">Centre hospitalier universitaire vaudois</saml2:AttributeValue><saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xsd:string">ahdis ag</saml2:AttributeValue><saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xsd:string">IK_Cabinet</saml2:AttributeValue></saml2:Attribute><saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization-id"><saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xsd:anyURI">urn:oid:1.1.44.17.205</saml2:AttributeValue><saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xsd:anyURI">urn:oid:2.16.756.5.30.1.145</saml2:AttributeValue><saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xsd:anyURI">urn:oid:2.16.756.5.30.1.999.9</saml2:AttributeValue></saml2:Attribute><saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:purposeofuse"><saml2:AttributeValue><PurposeOfUse xmlns="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" code="AUTO" codeSystem="2.16.756.5.30.1.127.3.10.5" codeSystemName="eHealth Suisse Verwendungszweck" displayName="Normal Access" xsi:type="CE"/></saml2:AttributeValue></saml2:Attribute><saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:resource:resource-id"><saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xsd:string">761337610916172626^^^&amp;2.16.756.5.30.1.127.3.10.3&amp;ISO</saml2:AttributeValue></saml2:Attribute><saml2:Attribute Name="urn:ihe:iti:xca:2010:homeCommunityId" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"><saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xsd:anyURI">urn:oid:2.16.756.5.30.1.191.1.0</saml2:AttributeValue></saml2:Attribute></saml2:AttributeStatement></saml2:Assertion>
</wsse:Security><Action soap:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing">urn:ihe:iti:2007:RegistryStoredQuery</Action><MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:33bb72fc-59d3-4525-8737-fba8bea73d7d</MessageID><To xmlns="http://www.w3.org/2005/08/addressing">http://test.ahdis.ch/eprik-cara/services/iti18Endpoint</To><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo></soap:Header><soap:Body><ns4:AdhocQueryRequest xmlns:ns6="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" xmlns:ns5="urn:ihe:iti:xds-b:2007" xmlns:ns4="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0" xmlns:ns3="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:ns2="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0"><ns4:ResponseOption returnType="LeafClass" returnComposedObjects="true"/><ns2:AdhocQuery id="urn:uuid:14d4debf-8f97-4251-9a74-a90016b0af0d"><ns2:Slot name="$XDSDocumentEntryPatientId"><ns2:ValueList><ns2:Value>'267ff2c1-f776-4bad-a7f0-00958ccdd717^^^&amp;2.16.756.5.30.1.191.1.0.2.1&amp;ISO'</ns2:Value></ns2:ValueList></ns2:Slot><ns2:Slot name="$XDSDocumentEntryStatus"><ns2:ValueList><ns2:Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Approved')</ns2:Value></ns2:ValueList></ns2:Slot></ns2:AdhocQuery></ns4:AdhocQueryRequest></soap:Body></soap:Envelope>